In [3]:
import pandas as pd

In [4]:
file = "Resources/sampleData.csv"

In [8]:
df_original = pd.read_csv(file)
df_original.head()
df_original.describe()

               id
count  100.000000
mean    50.500000
std     29.011492
min      1.000000
25%     25.750000
50%     50.500000
75%     75.250000
max    100.000000

In [11]:
# Set new index to last_name
df = df_original.set_index("last_name")
df.head()

            id first_name       Phone Number      Time zone
last_name
Richardson   1      Peter    7-(789)867-9023  Europe/Moscow
Berry        2     Janice   86-(614)973-1727    Asia/Harbin
Hudson       3     Andrea   86-(918)527-6371  Asia/Shanghai
Mcdonald     4     Arthur  420-(553)779-7783  Europe/Prague
Morales      5      Kathy  351-(720)541-2124  Europe/Lisbon

In [15]:
# Grab the data contained within the "Berry" row and the "Phone Number" column
berry_phone = df.loc[["Berry", "Richardson"], ["Phone Number", "first_name"]]
print("Using Loc: " + berry_phone)

also_berry_phone = df.iloc[0:49,[1,2]]
print("Using Iloc: " + also_berry_phone)

                           Phone Number         first_name
last_name
Berry       Using Loc: 86-(614)973-1727  Using Loc: Janice
Richardson   Using Loc: 7-(789)867-9023   Using Loc: Peter
Richardson  Using Loc: 62-(259)282-5871  Using Loc: Donald
                        first_name                   Phone Number
last_name
Richardson       Using Iloc: Peter    Using Iloc: 7-(789)867-9023
Berry           Using Iloc: Janice   Using Iloc: 86-(614)973-1727
Hudson          Using Iloc: Andrea   Using Iloc: 86-(918)527-6371
Mcdonald        Using Iloc: Arthur  Using Iloc: 420-(553)779-7783
Morales          Using Iloc: Kathy  Using Iloc: 351-(720)541-2124
Reyes             Using Iloc: Juan  Using Iloc: 507-(957)942-8540
Kim             Using Iloc: Joseph   Using Iloc: 62-(764)534-1192
Hudson         Using Iloc: Frances   Using Iloc: 57-(752)864-4744
Day               Using Iloc: Judy    Using Iloc: 7-(863)797-2311
Ford            Using Iloc: Robert   Using Iloc: 92-(784)853-3450
Jones           Using Iloc: Gloria  Using Iloc: 234-(535)368-6921
Hamilton      Using Iloc: Kimberly  Using Iloc: 965-(304)662-4587
Martin           Using Iloc: Diane   Using Iloc: 62-(925)748-3566
Cook           Using Iloc: Dorothy   Using Iloc: 63-(395)905-0818
Burke             Using Iloc: Jean    Using Iloc: 1-(239)909-4066
Kim             Using Iloc: Victor   Using Iloc: 56-(946)201-0528
Collins          Using Iloc: Donna  Using Iloc: 212-(566)954-4329
Day            Using Iloc: Michael   Using Iloc: 63-(142)279-5867
Montgomery        Using Iloc: Earl  Using Iloc: 963-(903)505-1179
Clark            Using Iloc: Billy   Using Iloc: 62-(213)345-2549
Black          Using Iloc: Patrick  Using Iloc: 507-(656)979-9509
Robertson      Using Iloc: Melissa   Using Iloc: 86-(634)498-0996
Andrews          Using Iloc: Billy   Using Iloc: 86-(859)746-5367
Austin           Using Iloc: Irene   Using Iloc: 61-(226)759-6213
Richardson      Using Iloc: Donald   Using Iloc: 62-(259)282-5871
Rice             Using Iloc: Jerry   Using Iloc: 86-(431)498-0654
Walker         Using Iloc: Jeffrey   Using Iloc: 62-(721)426-9225
Meyer           Using Iloc: Albert   Using Iloc: 66-(280)413-6219
Allen             Using Iloc: Ruby   Using Iloc: 62-(243)875-6700
Holmes           Using Iloc: Laura   Using Iloc: 86-(695)380-9449
Greene      Using Iloc: Jacqueline   Using Iloc: 60-(810)139-3409
Jordan        Using Iloc: Kathleen    Using Iloc: 1-(815)662-5397
Perez             Using Iloc: Judy   Using Iloc: 86-(678)426-2561
Morgan          Using Iloc: Brenda   Using Iloc: 51-(544)114-7243
Chavez             Using Iloc: Amy   Using Iloc: 62-(615)564-2160
Jordan            Using Iloc: Ryan   Using Iloc: 55-(309)200-6167
Bishop          Using Iloc: Philip   Using Iloc: 48-(785)440-8495
Banks            Using Iloc: Brian    Using Iloc: 1-(225)520-4670
Garrett         Using Iloc: Pamela   Using Iloc: 62-(787)484-0697
James            Using Iloc: Sarah    Using Iloc: 7-(114)687-3849
Perkins         Using Iloc: Teresa   Using Iloc: 33-(828)225-6343
Oliver        Using Iloc: Jonathan   Using Iloc: 62-(707)852-9095
Reid            Using Iloc: Albert   Using Iloc: 62-(248)357-7731
Dunn              Using Iloc: John   Using Iloc: 62-(307)117-6565
Vasquez        Using Iloc: Patrick   Using Iloc: 63-(280)931-7413
Johnson         Using Iloc: Victor   Using Iloc: 86-(811)655-6681
Miller          Using Iloc: Joseph   Using Iloc: 86-(798)217-1016
Gonzalez         Using Iloc: Diana   Using Iloc: 62-(664)623-7541
Washington        Using Iloc: Jack   Using Iloc: 93-(156)641-6824

In [6]:
# Grab the first five rows of data and the columns from "id" to "Phone Number"
# The problem with using "last_name" as the index is that the values are not unique so duplicates are returned
# If there are duplicates and loc[] is being used, Pandas will return an error
richardson_to_morales = df.loc[["Richardson", "Berry", "Hudson",
                                "Mcdonald", "Morales"], ["id", "first_name", "Phone Number"]]
print(richardson_to_morales)

print()

# Using iloc[] will not find duplicates since a numeric index is always unique
also_richardson_to_morales = df.iloc[0:4, 0:3]
print(also_richardson_to_morales)

            id first_name       Phone Number
last_name
Richardson   1      Peter    7-(789)867-9023
Richardson  25     Donald   62-(259)282-5871
Berry        2     Janice   86-(614)973-1727
Hudson       3     Andrea   86-(918)527-6371
Hudson       8    Frances   57-(752)864-4744
Hudson      90      Norma  351-(551)598-1822
Mcdonald     4     Arthur  420-(553)779-7783
Morales      5      Kathy  351-(720)541-2124

            id first_name       Phone Number
last_name
Richardson   1      Peter    7-(789)867-9023
Berry        2     Janice   86-(614)973-1727
Hudson       3     Andrea   86-(918)527-6371
Mcdonald     4     Arthur  420-(553)779-7783

In [7]:
# The following will select all rows for columns `first_name` and `Phone Number`
df.loc[:, ["first_name", "Phone Number"]].head()

           first_name       Phone Number
last_name
Richardson      Peter    7-(789)867-9023
Berry          Janice   86-(614)973-1727
Hudson         Andrea   86-(918)527-6371
Mcdonald       Arthur  420-(553)779-7783
Morales         Kathy  351-(720)541-2124

In [17]:
# the following logic test/conditional statement returns a series of boolean values
named_billy = df["first_name"] == "Billy"
named_billy.head()

last_name
Richardson    False
Berry         False
Hudson        False
Mcdonald      False
Morales       False
Name: first_name, dtype: bool

In [19]:
# Loc and Iloc also allow for conditional statments to filter rows of data
# using Loc on the logic test above only returns rows where the result is True
only_billys = df.loc[df["first_name"] == "Billy", :]
print(only_billys)

print()

# Multiple conditions can be set to narrow down or widen the filter
only_billy_and_peter = df.loc[(df["first_name"] == "Billy") | (
    df["first_name"] == "Peter"), :]
print(only_billy_and_peter)

           id first_name      Phone Number       Time zone
last_name
Clark      20      Billy  62-(213)345-2549   Asia/Makassar
Andrews    23      Billy  86-(859)746-5367  Asia/Chongqing
Price      59      Billy  86-(878)547-7739   Asia/Shanghai

            id first_name      Phone Number       Time zone
last_name
Richardson   1      Peter   7-(789)867-9023   Europe/Moscow
Clark       20      Billy  62-(213)345-2549   Asia/Makassar
Andrews     23      Billy  86-(859)746-5367  Asia/Chongqing
Price       59      Billy  86-(878)547-7739   Asia/Shanghai